{
  "services": [
    {
      "url": "#",
      "title": "E-Commerce Solutions",
      "image": "/uploads/images/services/1.webp",
      "intro": "We design and build secure, high-performing online stores with seamless payments, inventory, shipping, and analytics to maximize conversion.",
      "description": "We design and build secure, high-performing online stores with seamless payments, inventory, shipping, and analytics to maximize conversion. Our storefronts are optimized for fast mobile performance, accessible UX, and a frictionless checkout that reduces cart abandonment. We connect your stack—ERP/CRM, POS, tax, and fulfillment providers—so operations stay in sync and customers get real-time updates. From launch to scale, we provide ongoing CRO, performance monitoring, and support to keep revenue growing."
    },
    {
      "url": "#",
      "title": "Digital Transformation Consulting",
      "image": "/uploads/images/services/2.webp",
      "intro": "We assess your processes and tech stack and deliver a prioritized roadmap and quick wins to modernize operations and drive measurable results.",
      "description": "We assess your processes and tech stack and deliver a prioritized roadmap and quick wins to modernize operations and drive measurable results. Through stakeholder workshops and diagnostic audits, we surface bottlenecks, map customer journeys, and benchmark against industry best practices. We identify automation opportunities, rationalize tools, and design data flows that improve visibility and decision-making—then prove value with fast pilots. Finally, we establish KPIs and a change-management plan (training, governance, phased rollouts) to reduce risk and accelerate time to value."
    },
    {
      "url": "#",
      "title": "Custom .NET Web Development",
      "image": "/uploads/images/services/3.webp",
      "intro": "We specialize in building custom web applications, ensuring scalability, security, and performance.",
      "description": "We specialize in building custom web applications, ensuring scalability, security, and performance. We architect maintainable codebases with clean APIs and modern frameworks, ready for cloud-native deployment and seamless integration with your existing systems. From threat modeling and secure-by-default practices to automated testing, CI/CD, and observability, we bake reliability into every release. We pair fast, accessible UX with long-term support so your product can evolve without compromising quality."
    },
    {
      "url": "#",
      "title": "Custom Web Design (Responsive UI/UX)",
      "image": "/uploads/images/services/4.webp",
      "intro": "We craft human-centered, responsive interfaces—grounded in research and UX best practices—that look great on every device and boost engagement.",
      "description": "We craft human-centered, responsive interfaces—grounded in research and UX best practices—that look great on every device and boost engagement. We start with discovery, user journeys, and rapid prototyping, validating with usability testing to remove friction before build. Our design systems ensure consistency, accessibility (WCAG 2.2), and speed across products, while micro-interactions and performance tuning drive conversion. We iterate with analytics and A/B testing, continually refining the experience to meet your business goals."
    }
  ]
}